#include "Stage.h"

CStage::CStage()
{
}

CStage::~CStage()
{
}

//-------------------------------.
// 初期化関数.
//-------------------------------.
bool CStage::Init()
{
	return true;
}

//-------------------------------.
// 更新関数.
//-------------------------------.
void CStage::Update( const float& deltaTime )
{
}

//-------------------------------.
// 描画関数.
//-------------------------------.
void CStage::Render()
{
}

//-------------------------------.
// 当たり判定関数.
//-------------------------------.
void CStage::Collision( CActor* pActor )
{
}

//-------------------------------.
// 当たり判定の初期化.
//-------------------------------.
void CStage::InitCollision()
{
}

//-------------------------------.
// 当たり判定の座標や、半径などの更新.
//-------------------------------.
void CStage::UpdateCollision()
{
}